backend/app/controllers/auth_controller.rb

    def register
        user = User.new(user_params)

        if params[:password] != params[:password_confirmation]
          return render json: { message: 'Passwords don’t match' }, status: :unprocessable_entity
        end

        if user.save
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at", "password_digest") VALUES ('Hussain', 'hussain@gmail.com', NULL, '2025-03-11 08:24:52.500877', '2025-03-11 08:24:52.500877', '$2a$12$ib2reH0k4/PD.E3FqDjBAOADLKRcL2uAImJOI45i5Ycns/pNj6TRi') RETURNING "id"