backend/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ('heelo jii', 'my life', 1, '2025-03-10 11:49:00.930375', '2025-03-10 11:49:00.930375') RETURNING "id"
---
  def create
    blog = @current_user.blogs.build(blog_params)
    if blog.save

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = 1 AND "blogs"."id" = 1 LIMIT 1
UPDATE "blogs" SET "description" = 'I''ve created this blog to make sure', "updated_at" = '2025-03-10 11:48:41.529587' WHERE "blogs"."id" = 1
---
  def update
    blog = @current_user.blogs.find(params[:id])
    if blog.update(blog_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = 1 AND "blogs"."id" = 2 LIMIT 1
DELETE FROM "blogs" WHERE "blogs"."id" = 2
---
  def destroy
    blog = @current_user.blogs.find(params[:id])
    blog.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def authorize_request
    header = request.headers["Authorization"]
    token = header.split(" ").last if header

    Rails.logger.info "🔍 Incoming Token: #{token}"

    if token.nil?
      Rails.logger.error "❌ Token missing in request headers"
      return render json: { error: "Token missing" }, status: :unauthorized
    end

    begin
      secret_key = Rails.application.credentials.jwt_secret || ENV['JWT_SECRET']
      Rails.logger.info "🔑 Secret Key Used: #{secret_key}"

      decoded = JWT.decode(token, secret_key, true, algorithm: "HS256")[0]
      Rails.logger.info "✅ Decoded Token: #{decoded}"

      @current_user = User.find(decoded["user_id"])